app/views/lists/index.html.erb

SELECT "lists".* FROM "lists"  WHERE "lists"."user_id" = ?  [["user_id", 2]]
---
  <tbody>
    <% current_user.lists.each do |list| %>